Repository: Sentifyd/sentifyd-avatar-plugin
Catalog: languages/sentifyd-avatar-*.po
Languages: ar, de_de, es_es, fr_fr

source: Sentifyd Avatar
ar: أفاتار Sentifyd

source: Settings
ar: الإعدادات
de_de: Einstellungen
es_es: Ajustes
fr_fr: Réglages

source: Avatar Settings
ar: إعدادات الأفاتار
de_de: Avatar-Einstellungen
es_es: Configuración del avatar
fr_fr: Paramètres de l’avatar

source: Enter your avatar API Key
ar: أدخل مفتاح واجهة برمجة تطبيقات الأفاتار (API Key)
de_de: Geben Sie Ihren Avatar-API-Schlüssel ein
es_es: Ingrese su avatar API Clave
fr_fr: Entrez votre clé API avatar

source: Avatar ID
ar: معرّف الأفاتار
es_es: ID del avatar
fr_fr: ID de l'avatar

source: Secure Token Endpoint
ar: نقطة نهاية الرمز الآمن
de_de: Sicherer Token-Endpunkt
es_es: Punto de acceso de token seguro
fr_fr: Point de terminaison de jeton sécurisé

source: Require Authentication
ar: توثيق المستخدم مطلوب
de_de: Authentifizierung erforderlich
fr_fr: Authentification requise

source: Other Avatar Attributes
ar: سمات أخرى للأفاتار
de_de: Weitere Avatar-Attribute
es_es: Otros atributos del avatar
fr_fr: Autres attributs de l'avatar

source: Enable Toggler
ar: تفعيل زر التبديل
de_de: Toggler aktivieren
es_es: Activar conmutador
fr_fr: Activer le basculeur

source: Compact Mode
ar: الوضع المدمج
de_de: Kompaktmodus
es_es: Modo compacto
fr_fr: Mode compact

source: Enable Captions
ar: تفعيل العناوين
de_de: Untertitel aktivieren
es_es: Activar subtítulos
fr_fr: Activer les sous-titres

source: Branding Attributes
ar: سمات العلامة التجارية للأفاتار
de_de: Branding-Attribute
es_es: Atributos de marca
fr_fr: Attributs de marque

source: Brand Name
ar: اسم العلامة التجارية
de_de: Markenname
es_es: Nombre de la marca
fr_fr: Nom de la marque

source: Brand Logo URL
ar: رابط شعار العلامة التجارية
de_de: Markenlogo-URL
es_es: URL del logotipo de la marca
fr_fr: URL du logo de la marque

source: Terms Link
ar: رابط الشروط
de_de: Link zu den Nutzungsbedingungen
es_es: Enlace a los términos
fr_fr: Lien des conditions d'utilisation

source: Privacy Link
ar: رابط الخصوصية
de_de: Link zur Datenschutzerklärung
es_es: Enlace a la privacidad
fr_fr: Lien de la politique de confidentialité

source: Avatar Widget Theme
ar: مظهر واجهة الأفاتار
de_de: Avatar-Widget-Thema
es_es: Tema del widget de avatar
fr_fr: Thème du widget Avatar

source: Customize the avatar widget theme. Leave blank to use built-in defaults.
ar: خصّص مظهر واجهة الأفاتار. اترك فارغًا لاستخدام الإعدادات الافتراضية المضمّنة.
de_de: Passen Sie das Avatar-Widget-Design an. Lassen Sie das Feld leer, um die integrierten Standardeinstellungen zu verwenden.
es_es: Personalizar el tema del widget de avatar. Dejar en blanco para utilizar los valores predeterminados incorporados.
fr_fr: Personnalisez le thème du widget avatar. Laissez vide pour utiliser les valeurs par défaut intégrées.

source: Avatar Background
ar: خلفية الأفاتار
de_de: Avatar-Hintergrund
es_es: Fondo del avatar
fr_fr: Arrière-plan de l'avatar

source: Curved Corner Radius
ar: نصف قطر الزاوية المنحنية
de_de: Gebogener Eckradius
es_es: Radio de la esquina curvada
fr_fr: Rayon de coin courbé

source: Primary color
ar: اللون الأساسي
de_de: Primärfarbe
es_es: Color primario
fr_fr: Couleur primaire

source: Secondary color
ar: اللون الثانوي
de_de: Sekundärfarbe
es_es: Color secundario
fr_fr: Couleur secondaire

source: Text color primary on background
ar: لون النص للخلفية الأساسية
de_de: Textfarbe primär auf dem Hintergrund
es_es: Color de texto primario en el fondo
fr_fr: Couleur du texte primaire sur fond

source: Text color on secondary background
ar: لون النص للخلفية الثانوية
de_de: Textfarbe auf sekundärem Hintergrund
es_es: Color del texto en el fondo secundario
fr_fr: Couleur du texte sur fond secondaire

source: This plugin embeds the Sentifyd avatar web component which stores session-scoped data in the browser (sessionStorage) to maintain UI state and conversation context. Keys may include avatar open/closed state, authentication data such as short-lived tokens, and conversation transcript. Data clears when the tab/window closes. No data is stored in cookies or local storage by the widget.
ar: تقوم هذه الإضافة بتضمين مكوّن ويب أفاتار Sentifyd الذي يخزّن بيانات مرتبطة بالجلسة في المتصفح (sessionStorage) للحفاظ على حالة الواجهة وسياق المحادثة. قد تشمل المفاتيح حالة الأفاتار مفتوح/مغلق، بيانات المصادقة مثل الرموز قصيرة العمر، ونص المحادثة. تُمسح البيانات عند إغلاق التبويب/النافذة. لا يتم تخزين أي بيانات في ملفات تعريف الارتباط أو التخزين المحلي بواسطة الودجت.
de_de: Dieses Plugin bettet die Sentifyd-Avatar-Webkomponente ein, die sitzungsbezogene Daten im Browser (sessionStorage) speichert, um den UI-Zustand und den Gesprächskontext aufrechtzuerhalten. Schlüssel können den geöffnet/geschlossenen Zustand des Avatars, Authentifizierungsdaten wie kurzlebige Tokens und Gesprächstranskript umfassen. Daten werden gelöscht, wenn der Tab/Browser geschlossen wird. Es werden keine Daten in Cookies oder Local Storage durch das Widget gespeichert.
es_es: Este plugin incrusta el componente web del avatar Sentifyd que almacena datos con alcance de sesión en el navegador (sessionStorage) para mantener el estado de la interfaz y el contexto de la conversación. Las claves pueden incluir el estado abierto/cerrado del avatar, datos de autenticación como tokens de corta duración y la transcripción de la conversación. Los datos se borran cuando se cierra la pestaña/ventana. El widget no almacena datos en cookies ni en almacenamiento local.
fr_fr: Ce plugin intègre le composant Web d'avatar Sentifyd qui stocke des données liées à la session dans le navigateur (sessionStorage) pour maintenir l'état de l'interface et le contexte de conversation. Les clés peuvent inclure l'état ouvert/fermé de l'avatar, des données d'authentification telles que des jetons de courte durée et la transcription de la conversation. Les données sont effacées lorsque l'onglet/fenêtre se ferme. Aucune donnée n'est stockée dans les cookies ou le stockage local par le widget.

source: Show API Key
ar: إظهار مفتاح API
de_de: API-Schlüssel anzeigen
es_es: Mostrar clave API
fr_fr: Afficher la clé API

source: Hide API Key
ar: إخفاء مفتاح API
de_de: API-Schlüssel verbergen
es_es: Ocultar clave API
fr_fr: Masquer la clé API

source: Stored server-side only and used to mint short-lived tokens; never exposed in the browser DOM. Required unless you provide a custom token endpoint.
ar: تُخزن على الخادم فقط وتُستخدم لإنشاء رموز مميزة قصيرة العمر؛ لا تُعرض أبدًا في نموذج كائن المستند (DOM) للمتصفح. مطلوبة ما لم تقدم نقطة نهاية رمز مميز مخصصة.
de_de: Wird nur serverseitig gespeichert und zum Erstellen von kurzlebigen Tokens verwendet; wird niemals im Browser-DOM angezeigt. Erforderlich, es sei denn, Sie geben einen benutzerdefinierten Token-Endpunkt an.
es_es: Almacenada solo en el lado del servidor y utilizada para generar tokens de corta duración; nunca expuesta en el DOM del navegador. Requerida a menos que proporcione un punto de acceso de token personalizado.
fr_fr: Stockée uniquement côté serveur et utilisée pour générer des jetons de courte durée ; jamais exposée dans le DOM du navigateur. Requise sauf si vous fournissez un point de terminaison de jeton personnalisé.

source: Required
ar: إلزامي
de_de: Erforderlich
es_es: Requerido
fr_fr: Requis

source: Find your Avatar ID in the avatar page in Sentifyd platform.
ar: ابحث عن معرف الأفاتار الخاصة بك في صفحة الأفاتار في منصة Sentifyd.
de_de: Finden Sie Ihre Avatar-ID auf der Avatar-Seite der Sentifyd-Plattform.
es_es: Encuentra tu ID de avatar en la página del avatar en la plataforma Sentifyd.
fr_fr: Trouvez votre ID d’avatar dans la page d’avatar de la plateforme Sentifyd.

source: Optional. If provided, the avatar will call your secure token endpoint to obtain short-lived session tokens. If omitted, this plugin uses its built-in WordPress REST endpoint to mint tokens using your stored API key (which is never exposed to the browser).
ar: اختياري. إذا تم توفيره، سيتصل الأفاتار بنقطة نهاية الرمز الآمن الخاصة بك للحصول على رموز جلسة قصيرة العمر. إذا تم حذفه، يستخدم هذا المكون الإضافي نقطة نهاية WordPress REST المدمجة لإنشاء الرموز باستخدام مفتاح API المخزن (الذي لا يُعرض أبدًا للمتصفح).
de_de: Optional. Falls angegeben, ruft der Avatar Ihren sicheren Token-Endpunkt auf, um kurzlebige Sitzungs-Tokens zu erhalten. Wenn weggelassen, verwendet dieses Plugin seinen integrierten WordPress-REST-Endpunkt, um Tokens mit Ihrem gespeicherten API-Schlüssel zu erstellen (der niemals dem Browser ausgesetzt wird).
es_es: Opcional. Si se proporciona, el avatar llamará a su punto de acceso de token seguro para obtener tokens de sesión de corta duración. Si se omite, este plugin utiliza su punto de acceso REST de WordPress integrado para generar tokens utilizando su clave API almacenada (que nunca se expone al navegador).
fr_fr: Optionnel. S'il est fourni, l'avatar appellera votre point de terminaison de jeton sécurisé pour obtenir des jetons de session de courte durée. S'il est omis, cette extension utilise son point de terminaison REST WordPress intégré pour générer des jetons à l'aide de votre clé API stockée (qui n'est jamais exposée au navigateur).

source: Only display the avatar to logged-in users.
ar: إظهار الأفاتار للمستخدمين المسجلين للدخول فقط.
de_de: Den Avatar nur angemeldeten Benutzern anzeigen.
fr_fr: Afficher l'avatar uniquement aux utilisateurs connectés.

source: If enabled, guest visitors will not see the avatar and the API endpoint will reject unauthenticated requests.
ar: عند التفعيل، لن يرى الزوار غير المسجلين الأفاتار وسترفض نقطة نهاية API الطلبات غير المصادق عليها.
de_de: Wenn aktiviert, sehen Besucher den Avatar nicht und der API-Endpunkt lehnt nicht authentifizierte Anfragen ab.
fr_fr: Si cette option est activée, les visiteurs non connectés ne verront pas l'avatar et l'API rejettera les requêtes non authentifiées.

source: Display the avatar as a minimizable toggler (bottom-right style).
ar: عرض الأفاتار كزر تبديل قابل للتصغير (نمط أسفل اليمين).
de_de: Avatar als minimierbaren Toggler anzeigen (unten rechts).
es_es: Mostrar el avatar como un conmutador minimizable (estilo inferior derecho).
fr_fr: Afficher l'avatar sous forme de basculeur minimisable (en bas à droite).

source: When enabled (default), the plugin auto-injects the toggler on each page. When disabled, the avatar will not auto-inject;
ar: عند التفعيل (افتراضيًا)، يقوم المكون الإضافي بإدراج زر التبديل تلقائيًا في كل صفحة. عند التعطيل، لن يتم إدراج الأفاتار تلقائيًا؛
de_de: Wenn aktiviert (Standard), fügt das Plugin den Toggler automatisch auf jeder Seite ein. Wenn deaktiviert, wird der Avatar nicht automatisch eingefügt;
es_es: Cuando está habilitado (por defecto), el plugin inyecta automáticamente el conmutador en cada página. Cuando está deshabilitado, el avatar no se inyecta automáticamente;
fr_fr: Lorsqu'il est activé (par défaut), le plugin injecte automatiquement le basculeur sur chaque page. Lorsqu'il est désactivé, l'avatar ne s'injecte pas automatiquement ;

source: place it where you want using the shortcode %s.
ar: ضعه في أي مكان تريده باستخدام الكود القصير %s.
de_de: platzieren Sie ihn mit dem Shortcode %s an der gewünschten Stelle.
es_es: colócalo donde quieras utilizando el shortcode %s.
fr_fr: placez-le où vous voulez à l'aide du shortcode %s.

source: Displays the avatar without the header or footer.
ar: يعرض الأفاتار بدون رأس أو تذييل.
de_de: Zeigt den Avatar ohne Kopf- oder Fußbereich an.
es_es: Muestra el avatar sin encabezado ni pie de página.
fr_fr: Affiche l'avatar sans en-tête ni pied de page.

source: Show captions on the avatar by default.
ar: إظهار العناوين على الأفاتار بشكل افتراضي.
de_de: Untertitel standardmäßig im Avatar anzeigen.
es_es: Mostrar subtítulos en el avatar por defecto.
fr_fr: Afficher les sous-titres sur l'avatar par défaut.

source: Full URL to your Terms of Service.
ar: عنوان URL الكامل لشروط الخدمة.
de_de: Vollständige URL zu Ihren Nutzungsbedingungen.
es_es: URL completa de tus Términos de Servicio.
fr_fr: URL complète de vos conditions d'utilisation.

source: Full URL to your Privacy Policy.
ar: عنوان URL الكامل لسياسة الخصوصية.
de_de: Vollständige URL zu Ihrer Datenschutzerklärung.
es_es: URL completa de tu Política de Privacidad.
fr_fr: URL complète de votre politique de confidentialité.

source: The name of your brand or institution, used in the exported transcripts.
ar: اسم علامتك التجارية أو مؤسستك، ويُستخدم في النسخ المصدّرة.
de_de: Der Name Ihrer Marke oder Institution, verwendet in den exportierten Transkripten.
es_es: El nombre de tu marca o institución, utilizado en las transcripciones exportadas.
fr_fr: Le nom de votre marque ou institution, utilisé dans les transcriptions exportées.

source: The URL of the logo image displayed in the avatar's header.
ar: عنوان URL لصورة الشعار المعروضة في رأس الأفاتار.
de_de: Die URL des im Kopfbereich des Avatars angezeigten Logos.
es_es: La URL del logotipo que se muestra en el encabezado del avatar.
fr_fr: L'URL du logo affiché dans l'en-tête de l'avatar.

source: #ffffff or transparent
ar: #ffffff أو شفاف
de_de: #ffffff oder transparent
es_es: #ffffff o transparente
fr_fr: #ffffff ou transparent

source: Background behind the avatar. Accepts a CSS color value (e.g., #ffffff, rgb(0 0 0 / 0.5), or linear-gradient(135deg, #4f46e5 0%, #06b6d4 100%)).
ar: الخلفية وراء الأفاتار. تقبل قيمة لون CSS (مثل #ffffff أو rgb(0 0 0 / 0.5) أو linear-gradient(135deg, #4f46e5 0%, #06b6d4 100%)).
de_de: Hintergrund hinter dem Avatar. Akzeptiert einen CSS-Farbwert (z. B. #ffffff, rgb(0 0 0 / 0.5) oder linear-gradient(135deg, #4f46e5 0%, #06b6d4 100%)).
es_es: Fondo detrás del avatar. Acepta un valor de color CSS (p. ej., #ffffff, rgb(0 0 0 / 0.5) o linear-gradient(135deg, #4f46e5 0%, #06b6d4 100%)).
fr_fr: Arrière-plan derrière l'avatar. Accepte une valeur de couleur CSS (ex. : #ffffff, rgb(0 0 0 / 0.5) ou linear-gradient(135deg, #4f46e5 0%, #06b6d4 100%)).

source: Curved corner radius for the avatar widget. Accepts CSS length values (e.g., 12px, 1rem, 50%). Set to 0 for square corners.
ar: نصف قطر الزاوية المنحنية لواجهة المستخدم. يقبل قيم طول CSS (على سبيل المثال، 12px، 1rem، 50%). اضبط على 0 للزوايا المربعة.
de_de: Gebogener Eckradius für das Avatar-Widget. Akzeptiert CSS-Längenwerte (z. B. 12px, 1rem, 50 %). Für eckige Ecken auf 0 setzen.
es_es: Radio de esquina curvado para el widget avatar. Acepta valores de longitud CSS (por ejemplo, 12px, 1rem, 50%). Establecer a 0 para las esquinas cuadradas.
fr_fr: Rayon d’angle courbé pour le widget avatar. Accepte les valeurs de longueur CSS (par exemple, 12px, 1rem, 50%). Définissez à 0 pour les coins carrés.

source: Save Settings
ar: حفظ الإعدادات
de_de: Einstellungen speichern
es_es: Guardar ajustes
fr_fr: Enregistrer les réglages

source: Sentifyd Account Management
ar: إدارة حساب Sentifyd
de_de: Sentifyd-Kontoverwaltung
es_es: Gestión de cuenta de Sentifyd
fr_fr: Gestion du compte Sentifyd

source: Manage your Sentifyd account and conversation credits.
ar: إدارة حساب Sentifyd وأرصدة المحادثات.
de_de: Verwalten Sie Ihr Sentifyd-Konto und Gesprächsguthaben.
es_es: Administra tu cuenta de Sentifyd y tus créditos de conversación.
fr_fr: Gérez votre compte Sentifyd et vos crédits de conversation.

source: Visit Sentifyd.io
ar: زيارة Sentifyd.io
de_de: Besuchen Sie Sentifyd.io
es_es: Visitar Sentifyd.io
fr_fr: Visiter Sentifyd.io
